#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jyablonski_prac/github-terraform-demo/runs/run-yTdoBEfjmz6PGLr2

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Initializing plugins and modules...
aws_cloudwatch_log_group.aws_ecs_logs_dbt: Refreshing state... [id=jacobs_ecs_logs_dbt]
aws_cloudwatch_log_subscription_filter.jacobs_lambda_es_logs_stream: Refreshing state... [id=cwlsf-3005192471]
aws_cloudwatch_log_group.jacobs_adhoc_sns_ecs_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_adhoc_sns_ecs_lambda_function]
aws_iam_user.jacobs_deta_user: Refreshing state... [id=jacobs_deta_user]
aws_cloudwatch_log_group.jacobs_lambda_dynamodb_logs: Refreshing state... [id=/aws/lambda/jacobs_lambda_dynamodb]
aws_api_gateway_rest_api.jacobs_api_gateway: Refreshing state... [id=fgvdktt1h3]
aws_s3_bucket.jacobs_sqs_sns_bucket: Refreshing state... [id=jacobs-sqs-bucket]
aws_s3_bucket.jyablonski_mlflow_bucket: Refreshing state... [id=jyablonski-mlflow-bucket]
aws_iam_role.jacobs_firehose_role: Refreshing state... [id=jacobs_firehose_role]
aws_iam_role.jacobs_lambda_dynamodb_role: Refreshing state... [id=jacobs_lambda_dynamodb_role]
aws_sns_topic.jacobs_graphql_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-graphql-agent-topic]
aws_cloudwatch_event_rule.etl_rule_ml: Refreshing state... [id=python_scheduled_task_ml]
aws_iam_role.jacobs_ecs_ecr_role: Refreshing state... [id=jacobs_ecs_ecr_role]
aws_iam_policy.glue_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/jacobs_glue_policy]
aws_iam_policy.jacobs_stepfunction_execution_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/jacobs_stepfunctions_execution_policy]
aws_key_pair.mlflow_ec2_key: Refreshing state... [id=jacobs_mlflow_key]
aws_iam_role.jacobs_lambda_s3_role: Refreshing state... [id=jacobs_lambda_s3_role]
aws_sns_topic.jacobs_adhoc_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-adhoc-sns-topic]
aws_iam_role.jacobs_ecs_role: Refreshing state... [id=jacobs_ecs_role]
aws_cloudwatch_log_group.aws_ecs_logs_airflow: Refreshing state... [id=jacobs_ecs_logs_airflow]
aws_s3_bucket.jacobs_bucket_tf: Refreshing state... [id=jacobsbucket97]
aws_iam_role.jacobs_graphql_lambda_role: Refreshing state... [id=jacobs_graphql_lambda_role]
aws_ssm_parameter.jacobs_ssm_prac_secret: Refreshing state... [id=jacobs_ssm_pg_user]
aws_iam_role.jacobs_stepfunctions_role: Refreshing state... [id=jacobs_stepfunctions_role]
aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda-sns-policy]
aws_sns_topic.jacobs_sns_alarms_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-sns-alarms-topic]
aws_s3_bucket.jyablonski_unhappy_bucket: Refreshing state... [id=jyablonski-unhappy-bucket]
aws_glue_catalog_database.aws_glue_catalog_database_test: Refreshing state... [id=324816727452:jacobs_glue_catalog_database]
aws_cloudwatch_event_rule.etl_rule: Refreshing state... [id=python_scheduled_task_prod]
aws_ecr_repository.jacobs_repo: Refreshing state... [id=jacobs_repo]
aws_key_pair.airflow_ec2_key: Refreshing state... [id=airflow-ec2-key]
aws_cloudwatch_log_group.jacobs_lambda_alarm_logs: Refreshing state... [id=/aws/lambda/jacobs_lambda_alarm_function]
aws_iam_policy.jacobs_lambda_logging: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda_logging]
aws_cloudwatch_log_group.aws_ecs_logs_fake_ecs: Refreshing state... [id=jacobs_ecs_logs_fake_ecs]
aws_iam_user.jacobs_terraform_user: Refreshing state... [id=jacobs-terraform-user]
aws_cloudwatch_event_rule.step_functions_schedule: Refreshing state... [id=jacobs_stepfunctions_schedule]
aws_cloudwatch_log_group.jacobs_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_lambda_function]
aws_iam_user.jacobs_github_user: Refreshing state... [id=jacobs-github-ci]
aws_ssm_parameter.jacobs_ssm_prac_public: Refreshing state... [id=jacobs_ssm_test]
aws_vpc.jacobs_vpc_tf: Refreshing state... [id=vpc-00ef7bc92037b5bf0]
aws_cloudwatch_log_group.jacobs_rds_sns_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_rds_sns_lambda_function]
aws_iam_role.jacobs_lambda_es_role: Refreshing state... [id=jacobs_lambda_es_role]
aws_ecs_cluster.jacobs_ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:324816727452:cluster/jacobs_fargate_cluster]
aws_iam_group.jacobs_github_group: Refreshing state... [id=github-ecr-cicd]
aws_cloudwatch_log_group.jacobs_es_cluster_logs: Refreshing state... [id=jacobs-es-cluster-logs]
aws_cloudwatch_log_group.jacobs_adhoc_sns_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_adhoc_lambda_function]
aws_cloudwatch_event_rule.jacobs_rds_events_rule: Refreshing state... [id=jacobs-rds-events-rule]
aws_cloudwatch_log_group.jacobs_glue_logs: Refreshing state... [id=jacobs-glue-logs]
aws_s3_bucket.jacobs_bucket_tf_dev: Refreshing state... [id=jacobsbucket97-dev]
aws_cloudwatch_log_group.aws_ecs_logs: Refreshing state... [id=jacobs_ecs_logs]
aws_iam_role.jacobs_rds_sns_lambda_role: Refreshing state... [id=jacobs_rds_sns_lambda_role]
aws_cloudwatch_log_group.jacobs_sqs_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_sqs_lambda_function]
aws_cloudwatch_log_group.aws_stepfunction_logs: Refreshing state... [id=jacobs_stepfuntion_logs]
aws_iam_role.jacobs_glue_role: Refreshing state... [id=jacobs_glue_role]
aws_cloudwatch_event_rule.jacobs_graphql_agent_rule: Refreshing state... [id=jacobs_graphql_agent_trigger]
aws_dynamodb_table.jacobs_dynamodb_table: Refreshing state... [id=product-inventory]
aws_cloudwatch_event_rule.every_15_mins: Refreshing state... [id=python_scheduled_task_test]
aws_s3_bucket.jyablonski_lambda_bucket: Refreshing state... [id=jyablonski-lambda-bucket]
aws_iam_role.jacobs_adhoc_sns_lambda_role: Refreshing state... [id=jacobs_adhoc_sns_lambda_role]
aws_s3_bucket.jyablonski_tf_cicd_bucket: Refreshing state... [id=jyablonski-tf-cicd-bucket]
aws_cloudwatch_log_group.jacobs_graphql_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_graphql_agent_lambda]
aws_sns_topic.jacobs_rds_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-rds-sns-topic]
aws_s3_bucket.jacobs_kinesis_bucket: Refreshing state... [id=jacobs-kinesis-bucket]
aws_cloudwatch_log_group.aws_ecs_logs_ml: Refreshing state... [id=jacobs_ecs_logs_ml]
aws_iam_user.jacobs_airflow_user: Refreshing state... [id=jacobs_airflow_user]
aws_iam_user.jacobs_mlflow_user: Refreshing state... [id=jacobs-mlflow-user]
aws_iam_user_policy.jacobs_deta_user_policy: Refreshing state... [id=jacobs_deta_user:jacobs-deta-user-policy]
aws_sqs_queue.jacobs_graphql_sqs_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/324816727452/jacobs-graphql-agent-sqs]
aws_api_gateway_resource.api_gateway_products: Refreshing state... [id=geaudg]
aws_api_gateway_resource.api_gateway_health: Refreshing state... [id=kg2mm4]
aws_api_gateway_resource.api_gateway_product: Refreshing state... [id=fxfqkw]
aws_api_gateway_deployment.jacobs_api_gateway_deployment: Refreshing state... [id=b27ltq]
aws_s3_bucket_acl.jacobs_sqs_sns_bucket_acl: Refreshing state... [id=jacobs-sqs-bucket,private]
aws_sns_topic.jacobs_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-first-sns-topic]
aws_iam_role_policy_attachment.jacobs_lambda_dynamodb_role_attachment1: Refreshing state... [id=jacobs_lambda_dynamodb_role-20220130185654853600000002]
aws_iam_role_policy_attachment.jacobs_lambda_dynamodb_role_attachment2: Refreshing state... [id=jacobs_lambda_dynamodb_role-20220130185654851000000001]
aws_lambda_function.jacobs_lambda_dynamodb_function: Refreshing state... [id=jacobs_lambda_dynamodb]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment3: Refreshing state... [id=jacobs_firehose_role-20220320155547865000000002]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment1: Refreshing state... [id=jacobs_firehose_role-20220320155547862400000001]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment4: Refreshing state... [id=jacobs_firehose_role-20220320155547866700000003]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment2: Refreshing state... [id=jacobs_firehose_role-20220320155547866900000004]
aws_iam_role_policy_attachment.jacobs_ecs_ecr_role_attachment: Refreshing state... [id=jacobs_ecs_ecr_role-20210828175249545600000002]
aws_cloudwatch_metric_alarm.rds_alarm: Refreshing state... [id=rds-cpu-alarm]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment3: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438870600000003]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_5: Refreshing state... [id=jacobs_lambda_s3_role-20220121033244641900000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment1: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438861200000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_4: Refreshing state... [id=jacobs_lambda_s3_role-20211222000709626900000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment2: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438866400000002]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_6: Refreshing state... [id=jacobs_lambda_s3_role-20220121034021133800000001]
aws_ecr_lifecycle_policy.jacobs_repo_policy: Refreshing state... [id=jacobs_repo]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_s3: Refreshing state... [id=jacobs_ecs_role-20211107185721292100000001]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment: Refreshing state... [id=jacobs_ecs_role-20210828175249551700000003]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_ses: Refreshing state... [id=jacobs_ecs_role-20210904181629178300000001]
aws_ecs_task_definition.jacobs_fake_ecs_task: Refreshing state... [id=jacobs_fake_ecs_task]
aws_s3_bucket_public_access_block.jacobs_bucket_tf_access: Refreshing state... [id=jacobsbucket97]
aws_glue_catalog_table.aws_glue_catalog_table_injuries: Refreshing state... [id=324816727452:jacobs_glue_catalog_database:jacobs_catalog_table_injuries]
aws_s3_bucket_acl.jyablonski_bucket_tf_acl: Refreshing state... [id=jacobsbucket97,private]
aws_s3_bucket_lifecycle_configuration.jacobs_bucket_lifecycle_policy: Refreshing state... [id=jacobsbucket97]
aws_iam_user_policy_attachment.jacobs_terraform_user_attachment: Refreshing state... [id=jacobs-terraform-user-20211211210959483500000001]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=jacobs_lambda_s3_role-20211115225458369200000001]
aws_iam_role_policy_attachment.jacobs_graphql_logs_policy: Refreshing state... [id=jacobs_graphql_lambda_role-20220601173205822800000001]
aws_iam_role_policy_attachment.jacobs_graphql_sqs_policy: Refreshing state... [id=jacobs_graphql_lambda_role-20220601234540367500000001]
aws_iam_role_policy_attachment.jacobs_graphql_eventbridge_rule_policy: Refreshing state... [id=jacobs_graphql_lambda_role-20220601223816585700000001]
aws_iam_group_policy_attachment.jacobs_github_group_policy_attach: Refreshing state... [id=github-ecr-cicd-20210828175249204100000001]
aws_iam_group_membership.jacobs_github_group_attach: Refreshing state... [id=tf-testing-group-membership]
aws_cloudwatch_log_resource_policy.jacobs_es_cluster_logs: Refreshing state... [id=jacobs_es_cluster_logs]
aws_iam_role_policy_attachment.jacobs_stepfunctions_role_attachment_ses: Refreshing state... [id=jacobs_stepfunctions_role-20220621201646929800000001]
aws_iam_role_policy_attachment.jacobs_stepfunctions_role_attachment_cloudwatch_events: Refreshing state... [id=jacobs_stepfunctions_role-20220619025338693900000001]
aws_iam_role_policy_attachment.jacobs_stepfunctions_role_attachment_cloudwatch_logs: Refreshing state... [id=jacobs_stepfunctions_role-20220619022538222900000001]
aws_iam_role_policy_attachment.jacobs_stepfunctions_role_attachment_eventbridge: Refreshing state... [id=jacobs_stepfunctions_role-20220619032731280100000001]
aws_iam_role_policy_attachment.jacobs_stepfunctions_role_attachment1: Refreshing state... [id=jacobs_stepfunctions_role-20220619020156557800000001]
aws_api_gateway_rest_api_policy.jacobs_api_policy: Refreshing state... [id=fgvdktt1h3]
aws_elasticsearch_domain.jacobs_opensearch_cluster: Refreshing state... [id=arn:aws:es:us-east-1:324816727452:domain/jacobs-opensearch-cluster]
aws_iam_policy.lambda_es_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda-es-policy]
aws_s3_bucket_policy.allow_access_from_another_account: Refreshing state... [id=jacobsbucket97]
aws_s3_bucket_acl.jyablonski_unhappy_bucket_acl: Refreshing state... [id=jyablonski-unhappy-bucket,private]
aws_lambda_permission.jacobs_graphql_cloudwatch_permission: Refreshing state... [id=AllowExecutionFromCloudWatchGraphQL]
aws_cloudwatch_event_target.jacobs_rds_sns_topic_target: Refreshing state... [id=jacobs-rds-events-rule-SendRDSEventsToSNS]
aws_iam_role_policy_attachment.jacobs_lambda_es_role_attachment1: Refreshing state... [id=jacobs_lambda_es_role-20220201024731234400000001]
aws_security_group.jacobs_task_security_group_tf: Refreshing state... [id=sg-0e3e9289166404b84]
aws_internet_gateway.jacobs_gw: Refreshing state... [id=igw-021b87557060ce529]
aws_subnet.jacobs_public_subnet: Refreshing state... [id=subnet-0652b6b91d94ebcd0]
aws_subnet.jacobs_public_subnet_2: Refreshing state... [id=subnet-0047afa4a7e93ec89]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_cloudwatch_logs: Refreshing state... [id=jacobs_airflow_user-20211230231428753500000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ssm: Refreshing state... [id=jacobs_airflow_user-20211124210309375300000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ecr: Refreshing state... [id=jacobs_airflow_user-20211018231134709200000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_s3: Refreshing state... [id=jacobs_airflow_user-20211107232055534100000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ses: Refreshing state... [id=jacobs_airflow_user-20211018230933484100000002]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment: Refreshing state... [id=jacobs_airflow_user-20211011013703213600000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_execution: Refreshing state... [id=jacobs_airflow_user-20211018230933480900000001]
aws_iam_policy.jacobs_stepfunction_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/jacobs_stepfunctions_policy]
aws_iam_policy.lambda_sns_ecs_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda-sns-ecs_policy]
aws_iam_user_policy_attachment.jacobs_mlflow_user_attachment_s3: Refreshing state... [id=jacobs-mlflow-user-20220315144005082100000001]
aws_iam_role_policy_attachment.jacobs_rds_sns_lambda_log_attachment_3: Refreshing state... [id=jacobs_rds_sns_lambda_role-20220214232214848900000001]
aws_iam_role_policy_attachment.jacobs_rds_sns_lambda_log_attachment1: Refreshing state... [id=jacobs_rds_sns_lambda_role-20220214221148698400000002]
aws_iam_role_policy_attachment.jacobs_rds_sns_lambda_log_attachment2: Refreshing state... [id=jacobs_rds_sns_lambda_role-20220214221148698200000001]
aws_s3_bucket_public_access_block.jacobs_bucket_tf_access_dev: Refreshing state... [id=jacobsbucket97-dev]
aws_s3_bucket_lifecycle_configuration.jacobs_bucket_lifecycle_policy_dev: Refreshing state... [id=jacobsbucket97-dev]
aws_s3_bucket_policy.allow_access_from_another_account_dev: Refreshing state... [id=jacobsbucket97-dev]
aws_s3_bucket_acl.jyablonski_bucket_tf_acl_dev: Refreshing state... [id=jacobsbucket97-dev,private]
aws_api_gateway_method.api_gateway_products_get: Refreshing state... [id=agm-fgvdktt1h3-geaudg-GET]
aws_api_gateway_method.api_gateway_health_get: Refreshing state... [id=agm-fgvdktt1h3-kg2mm4-GET]
aws_api_gateway_method.api_gateway_product_post: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-POST]
aws_sns_topic_subscription.jacobs_graphql_topic_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-graphql-agent-topic:56e5aefd-1248-4450-8512-d5ab8177c2ff]
aws_api_gateway_method.api_gateway_product_patch: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-PATCH]
aws_api_gateway_method.api_gateway_product_get: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-GET]
aws_api_gateway_method.api_gateway_product_delete: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-DELETE]
aws_api_gateway_stage.jacobs_deployment_stage: Refreshing state... [id=ags-fgvdktt1h3-Dev]
aws_iam_role_policy_attachment.jacobs_glue_role_attachment1: Refreshing state... [id=jacobs_glue_role-20220311221650755100000001]
aws_glue_job.jacobs_glue_job: Refreshing state... [id=jacobs_glue_job]
aws_sqs_queue.jacobs_sqs_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/324816727452/jacobs-first-sqs]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment2: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220217011541320700000003]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment_4: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220503191842136900000001]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment1: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220217011541272900000001]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment_3: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220217011541273300000002]
aws_lambda_function.jacobs_lambda_alarm_function: Refreshing state... [id=jacobs_lambda_alarm_function]
aws_s3_bucket_acl.kinesis_bucket_acl: Refreshing state... [id=jacobs-kinesis-bucket,private]
aws_lambda_function.jacobs_adhoc_sns_ecs_lambda_function: Refreshing state... [id=jacobs_adhoc_sns_ecs_lambda_function]
aws_lambda_function.jacobs_rds_sns_lambda_function: Refreshing state... [id=jacobs_rds_sns_lambda_function]
aws_lambda_function.jacobs_s3_sqs_lambda_function: Refreshing state... [id=jacobs_sqs_lambda_function]
aws_lambda_function.jacobs_s3_lambda_function: Refreshing state... [id=jacobs_lambda_function]
aws_s3_bucket_acl.jyablonski_lambda_bucket_acl: Refreshing state... [id=jyablonski-lambda-bucket,private]
aws_sns_topic_policy.jacobs_rds_sns_topic_policy: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-rds-sns-topic]
aws_s3_bucket_acl.jyablonski_tf_cicd_bucket_acl: Refreshing state... [id=jyablonski-tf-cicd-bucket,private]
aws_iam_role_policy_attachment.jacobs_lambda_es_role_attachment2: Refreshing state... [id=jacobs_lambda_es_role-20220201024731235300000002]
aws_route_table.jacobs_public_route_table: Refreshing state... [id=rtb-09226b87b7cd35ec8]
aws_ssm_parameter.jacobs_ssm_sg_task: Refreshing state... [id=jacobs_ssm_sg_task]
aws_security_group.jacobs_rds_security_group_tf: Refreshing state... [id=sg-04be859fa9163a50a]
aws_ssm_parameter.jacobs_ssm_subnet1: Refreshing state... [id=jacobs_ssm_subnet1]
aws_instance.jacobs_ec2_airflow: Refreshing state... [id=i-0de57e8d89f3de6aa]
aws_ssm_parameter.jacobs_ssm_subnet2: Refreshing state... [id=jacobs_ssm_subnet2]
aws_db_subnet_group.jacobs_subnet_group: Refreshing state... [id=jacobs-subnet-group]
aws_iam_role_policy_attachment.jacobs_stepfunctions_role_attachment2: Refreshing state... [id=jacobs_stepfunctions_role-20220523230025883200000002]
aws_api_gateway_integration.api_gateway_health_get_integration: Refreshing state... [id=agi-fgvdktt1h3-kg2mm4-GET]
aws_lambda_permission.apigw_lambda_health: Refreshing state... [id=AllowExecutionFromAPIGatewayGetHealth]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment_5: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220503194306173200000001]
aws_api_gateway_integration.api_gateway_product_patch_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-PATCH]
aws_lambda_permission.apigw_lambda_product_patch: Refreshing state... [id=AllowExecutionFromAPIGatewayPatchProduct]
aws_lambda_permission.apigw_lambda_products_get: Refreshing state... [id=AllowExecutionFromAPIGatewayGetProducts]
aws_api_gateway_integration.api_gateway_products_get_integration: Refreshing state... [id=agi-fgvdktt1h3-geaudg-GET]
aws_lambda_permission.apigw_lambda_product_post: Refreshing state... [id=AllowExecutionFromAPIGatewayPostProduct]
aws_api_gateway_integration.api_gateway_product_post_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-POST]
aws_lambda_permission.apigw_lambda_product: Refreshing state... [id=AllowExecutionFromAPIGatewayGetProduct]
aws_api_gateway_integration.api_gateway_product_get_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-GET]
aws_api_gateway_integration.api_gateway_product_delete_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-DELETE]
aws_lambda_permission.apigw_lambda_product_delete: Refreshing state... [id=AllowExecutionFromAPIGatewayDeleteProduct]
aws_sns_topic_subscription.enable_lambda_sns: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-first-sns-topic:781d5c14-ab92-4751-b132-e4a82e5ddaea]
aws_sns_topic_subscription.enable_adhoc_lambda_sns_ecs: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-adhoc-sns-topic:f6e26925-5963-4a80-a1d2-be191db6f900]
aws_lambda_permission.allow_adhoc_sns_ecs_lambda_permission: Refreshing state... [id=AllowadhocLambdaExecutionFromSNSecs]
aws_lambda_permission.allow_bucket1: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=jyablonski-lambda-bucket]
aws_sns_topic_subscription.allow_sns_invoke_rds_lambda: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-rds-sns-topic:3a25486b-8d82-4eca-8950-f6eff0470bbd]
aws_lambda_permission.allow_rds_sns_lambda_permission: Refreshing state... [id=AllowRDSLambdaExecutionFromSNS]
aws_sns_topic_subscription.enable_lambda_alarm: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-sns-alarms-topic:34d4cf43-94f1-47fd-b51b-71c00fb8543b]
aws_lambda_permission.allow_lambda_alarm_permission: Refreshing state... [id=AllowLambdaAlarm]
aws_route_table_association.jacobs_public_route: Refreshing state... [id=rtbassoc-0b0bbb75130f63d05]
aws_lambda_permission.allow_bucket_sqs: Refreshing state... [id=AllowExecutionFromS3Bucketsqs]
aws_route_table_association.jacobs_public_route_2: Refreshing state... [id=rtbassoc-0e5a3b38154f8baf6]
aws_lambda_event_source_mapping.enable_lambda_sqs: Refreshing state... [id=29fbb536-6cb0-46e8-8788-faabd9e0cdaa]
aws_db_instance.jacobs_rds_tf: Refreshing state... [id=jacobs-rds-server]
aws_s3_bucket_notification.bucket_notification_sqs_sns: Refreshing state... [id=jacobs-sqs-bucket]
aws_ecs_task_definition.jacobs_ecs_task_airflow: Refreshing state... [id=jacobs_task_airflow]
aws_ecs_task_definition.jacobs_ecs_task_dbt: Refreshing state... [id=jacobs_task_dbt]
aws_ecs_task_definition.jacobs_ecs_task: Refreshing state... [id=jacobs_task]
aws_ecs_task_definition.jacobs_ecs_task_ml: Refreshing state... [id=jacobs_task_ml]
aws_lambda_function.jacobs_graphql_agent_lambda_function: Refreshing state... [id=jacobs_graphql_agent_lambda]
aws_cloudwatch_event_target.ecs_scheduled_task: Refreshing state... [id=python_scheduled_task_prod-jacobs_target_id]
aws_sfn_state_machine.jacobs_state_machine: Refreshing state... [id=arn:aws:states:us-east-1:324816727452:stateMachine:NBA_ELT_PIPELINE_STATE_MACHINE]
aws_cloudwatch_event_target.ecs_scheduled_task_ml: Refreshing state... [id=python_scheduled_task_ml-jacobs_target_id]
aws_cloudwatch_event_target.jacobs_graphql_agent_target: Refreshing state... [id=jacobs_graphql_agent_trigger-jacobs_graphql_agent_id]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_db_instance.jacobs_rds_tf has changed
  ~ resource "aws_db_instance" "jacobs_rds_tf" {
        id                                    = "jacobs-rds-server"
      ~ latest_restorable_time                = "2022-06-26T18:44:30Z" -> "2022-07-01T14:43:48Z"
        name                                  = "jacob_db"
        tags                                  = {
            "Environment" = "Prod"
            "Name"        = "Jacobs TF Project"
        }
        # (57 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.jacobs_ssm_dbt_prac_key will be created
  + resource "aws_ssm_parameter" "jacobs_ssm_dbt_prac_key" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "dbt prac key"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "jacobs_ssm_dbt_prac_key"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "String"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.jacobs_ssm_rds_db_name will be created
  + resource "aws_ssm_parameter" "jacobs_ssm_rds_db_name" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "RDS DB Name"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "jacobs_ssm_rds_db_name"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.jacobs_ssm_rds_host will be created
  + resource "aws_ssm_parameter" "jacobs_ssm_rds_host" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "RDS Host IP"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "jacobs_ssm_rds_host"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.jacobs_ssm_rds_pw will be created
  + resource "aws_ssm_parameter" "jacobs_ssm_rds_pw" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "RDS Host IP"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "jacobs_ssm_rds_pw"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.jacobs_ssm_rds_schema will be created
  + resource "aws_ssm_parameter" "jacobs_ssm_rds_schema" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "RDS Schema"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "jacobs_ssm_rds_schema"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # aws_ssm_parameter.jacobs_ssm_rds_user will be created
  + resource "aws_ssm_parameter" "jacobs_ssm_rds_user" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "RDS Username"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "jacobs_ssm_rds_user"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @jyablonski, Action: `pull_request`*